In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.max_rows", 999)
pd.set_option("display.max_columns", 999)
pd.set_option('display.max_rows', 999)
pd.set_option('display.min_rows', 999)

%config IPCompleter.use_jedi = False

In [2]:
df = pd.read_csv('../data/df_clean_unreg.csv')
df['gr_droppedout_pct'] = df.gr_graduated / df.total
df['gr_graduated_pct'] = df.gr_graduated / df.total
df['gr_iep_pct'] = df.gr_iep / df.total
df['gr_ged_pct'] = df.gr_ged / df.total
df['gr_stillenrolled_pct'] = df.gr_stillenrolled / df.total

dropcols = ["Unnamed: 0", "Unnamed: 0.1", "district_cd", "cohortye", "total", "gr_droppedout", "gr_graduated", "gr_iep", "gr_ged", 
            "gr_stillenrolled", "outcome_yrs", "srcyear", "year", "district_from_df1", "subgroup", "district_from_faru", "districtid", "name", "district_name"]

df_thin = df.drop(columns=dropcols)
df_thin.head()

,num_asian,num_black,num_hisp,num_am_ind,num_white,num_lep,num_free_lunch,num_reduced_lunch,num_multi,ufb,staid,star,totstat,lrev,fedrev,totrev,state_aid_total_revenues,star_total_revenues,state_revenues_total_revenues,bded,cadm,tsal,pps,cds,boc,tui1,tui2,ois,oiexp,cser,opmt,tchr,heal,oeb,total_fringe_benefits,ound,oth,subtot,trans,dsp,dsi,texp,total_unexpended_surplus_funds_t,revenue_expenditures,var,dcaadm,rev_pupil,exp_pupil,av_twpu,inc_twpu,pwr,apwr,cwr,instructional_salaries,instructional_fringe_benefits,ins_fb,adjusted_expenditures__subtotal,ie1,ie1_total,ie2_instructional_expenditures_i,ie2,ie3_instructional_expenditures_i,ie3_adj_exp,loc_eff_rate,county_name,gr_droppedout_pct,gr_graduated_pct,gr_iep_pct,gr_ged_pct,gr_stillenrolled_pct
0,269.0,5952.0,918.0,21.0,1884.0,300.0,5505.0,970.0,0.0,5680290,54570126,10225351,64795477,98285968,16659701,179741146,0.303604,0.056889,0.360493,490999,2118256,54023846,5251097,4501195,3728010,188593,6610228,16305802,19303934,1199428,11203660,5165294,14257866,14441655,33864815,4053261,564400,163407524,5972182,7669294,5365766,182414766,0.031139,-2673620,-0.014657,10559,17022.553840,17275.761530,244659,93587,0.706290,0.789764,0.748027,83809950,3.117730e+07,0.170914,162986931,109912705.0,0.602543,1.410900e+08,0.773457,1.409014e+08,0.864495,26.51,Albany,0.658576,0.658576,0.033981,0.092233,0.080906
1,360.0,5281.0,940.0,24.0,1654.0,382.0,3992.0,789.0,77.0,13358464,74675977,10131780,84807757,105784891,13677063,204269711,0.365575,0.049600,0.415175,385910,2055778,55114952,5988074,4266372,4793593,541340,7253219,17557992,26611527,602434,11451223,5439024,16966397,11086334,33491755,3264726,989999,174368894,6153173,7356028,6733231,194611326,0.068642,9658385,0.049629,10430,19584.823682,18658.804027,268181,99117,0.628353,0.725600,0.676977,87720983,3.087779e+07,0.158664,173595554,122127069.0,0.627543,1.530049e+08,0.786207,1.524635e+08,0.878269,21.95,Albany,0.663212,0.663212,0.069085,0.046632,0.048359
2,360.0,5281.0,940.0,24.0,1654.0,382.0,3992.0,789.0,77.0,13358464,74675977,10131780,84807757,105784891,13677063,204269711,0.365575,0.049600,0.415175,385910,2055778,55114952,5988074,4266372,4793593,541340,7253219,17557992,26611527,602434,11451223,5439024,16966397,11086334,33491755,3264726,989999,174368894,6153173,7356028,6733231,194611326,0.068642,9658385,0.049629,10430,19584.823682,18658.804027,268181,99117,0.628353,0.725600,0.676977,87720983,3.087779e+07,0.158664,173595554,122127069.0,0.627543,1.530049e+08,0.786207,1.524635e+08,0.878269,21.95,Albany,0.564767,0.564767,0.051813,0.044905,0.193437
3,360.0,5281.0,940.0,24.0,1654.0,382.0,3992.0,789.0,77.0,13358464,74675977,10131780,84807757,105784891,13677063,204269711,0.365575,0.049600,0.415175,385910,2055778,55114952,5988074,4266372,4793593,541340,7253219,17557992,26611527,602434,11451223,5439024,16966397,11086334,33491755,3264726,989999,174368894,6153173,7356028,6733231,194611326,0.068642,9658385,0.049629,10430,19584.823682,18658.804027,268181,99117,0.628353,0.725600,0.676977,87720983,3.087779e+07,0.158664,173595554,122127069.0,0.627543,1.530049e+08,0.786207,1.524635e+08,0.878269,21.95,Albany,0.685665,0.685665,0.070812,0.050086,0.015544
4,382.0,4894.0,908.0,27.0,1592.0,405.0,4660.0,757.0,96.0,11443927,88986207,9683819,98670026,108582740,12186499,219439265,0.405516,0.044130,0.449646,325611,2333872,57538745,6323772,4632120,5340457,734445,7801336,18044340,30170560,428795,11628871,5143395,17442327,13876660,36462382,3527941,760170,186053417,6320002,8410609,6874804,207658832,0.055109,11780433,0.056730,10702,20504.509905,19403.740609,310466,103451,0.650327,0.694768,0.672548,91879434,3.307660e+07,0.159283,185202972,130585775.0,0.628800,1.636624e+08,0.788131,1.629279e+08,0.879726,21.25,Albany,0.646179,0.646179,0.036545,0.024917,0.054817

In [3]:
df.tail(20).to_csv('/Users/dave/src/CSE6242/dave/small_headers.csv')

# PCA, Modeling and Predictions by County

In [4]:
%%time
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn import linear_model
from sklearn.metrics import mean_squared_error, r2_score, accuracy_score


results = {}
county_agg_results = pd.DataFrame()

def train_model(X, y, test_size=0.30, random_state=42):
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=test_size, random_state=random_state)
    regr = linear_model.LinearRegression()
    regr.fit(X_train, y_train)
    y_pred = regr.predict(X_test)
    mse = mean_squared_error(y_test, y_pred)
    r2 = r2_score(y_test, y_pred)
    m1 = regr.coef_[0]
    m2 = regr.coef_[1]
    c = regr.intercept_
    return(y_pred, mse, r2, m1, m2, c)

i = 0
imp = {}

for county in df_thin.county_name.unique():
    county_df = df_thin[df_thin.county_name == county].drop(columns = ['county_name', 'num_am_ind'])
    X = county_df.drop(["gr_droppedout_pct", "gr_graduated_pct", "gr_iep_pct", "gr_ged_pct", "gr_stillenrolled_pct"], axis=1, inplace=False)
    y = pd.DataFrame({'y':county_df['gr_graduated_pct']}).reset_index()
    x = StandardScaler().fit_transform(X)
    pca = PCA(n_components=2)
    principalComponents = pca.fit_transform(x)
    principalDF = pd.DataFrame(data = principalComponents, 
                               columns = ['X1', 'X2'])
    
    
    n_pcs= pca.components_.shape[0]
    
    # get most important features:
    most_important = [np.abs(pca.components_[i]).argmax() for i in range(n_pcs)]

    initial_feature_names = list(X.columns)
    # get the names
    most_important_names = [initial_feature_names[most_important[i]] for i in range(n_pcs)]

    # LIST COMPREHENSION HERE AGAIN
    dic = {'PC{}'.format(i): most_important_names[i] for i in range(n_pcs)}

    # build the dataframe
    imp_df = pd.DataFrame(dic.items())
    imp[county] = imp_df
    
    
    raw_df = pd.concat([principalDF, y.y], axis=1)
    y_pred, mse, r2, m1, m2, c = train_model(X = principalDF, y = y.y)
    
    raw_df_pred = pd.concat([raw_df, pd.DataFrame(y_pred)], axis=1)
    
    raw_df_pred.rename(columns={0:'y_pred'}, inplace=True)
    results[county] = raw_df_pred    
    
    agg_results = pd.DataFrame({'EV': pca.explained_variance_ratio_[0] + pca.explained_variance_ratio_[1], 
                                'MSE': mse,
                                'R2': r2, 
                                'M1': m1,
                                'M2': m2,
                                'C': c}, 
                                index=[county])
    county_agg_results = county_agg_results.append(agg_results)
    i = i+1

# X1 - PCA1
# X2 - PCA2
# Y - gr_graduated_pct
# Pred Y () # this can be any model (linear regression + line of best fit formula (so C & M Parameters))
# County

CPU times: user 7.44 s, sys: 2.01 s, total: 9.45 s
Wall time: 1.81 s

# PCA Most Important Feature by County
It should be noted that these are mostly revenue and expenditure based.

In [5]:
imp

{'Albany':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Schoharie':      0       1
 0  PC0  totrev
 1  PC1     cwr,
 'Greene':      0          1
 0  PC0        ie1
 1  PC1  exp_pupil,
 'Schenectady':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1     state_revenues_total_revenues,
 'Allegany':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Steuben':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Livingston':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Wyoming':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                         inc_twpu,
 'Cattaraugus':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                              apwr,
 'Broome':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Chenango':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Tioga':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                        ie1_total,
 'Delaware':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Cortland':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Chautauqua':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Erie':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                              apwr,
 'Cayuga':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Onondaga':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1          state_aid_total_revenues,
 'Oswego':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Wayne':      0       1
 0  PC0  totrev
 1  PC1     oth,
 'Tompkins':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                        rev_pupil,
 'Chemung':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Schuyler':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Otsego':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Madison':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              pwr,
 'Clinton':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Essex':      0                              1
 0  PC0         instructional_salaries
 1  PC1  state_revenues_total_revenues,
 'Franklin':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                               cwr,
 'Columbia':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1     state_revenues_total_revenues,
 'Dutchess':      0                         1
 0  PC0                       ie1
 1  PC1  state_aid_total_revenues,
 'Rensselaer':      0         1
 0  PC0       ie1
 1  PC1  inc_twpu,
 'Ulster':      0    1
 0  PC0  ie1
 1  PC1  cwr,
 'Putnam':      0                    1
 0  PC0               totrev
 1  PC1  star_total_revenues,
 'Genesee':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                           av_twpu,
 'Niagara':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Warren':      0                       1
 0  PC0  instructional_salaries
 1  PC1                inc_twpu,
 'St. Lawrence':      0       1
 0  PC0  totrev
 1  PC1     pwr,
 'Fulton':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1     state_revenues_total_revenues,
 'Montgomery':      0                                 1
 0  PC0  ie3_instructional_expenditures_i
 1  PC1                               cwr,
 'Hamilton':      0       1
 0  PC0  totrev
 1  PC1     var,
 'Saratoga':      0       1
 0  PC0  totrev
 1  PC1     pwr,
 'Monroe':      0                              1
 0  PC0                           texp
 1  PC1  state_revenues_total_revenues,
 'Orleans':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                         exp_pupil,
 'Herkimer':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              cwr,
 'Oneida':      0                         1
 0  PC0                       ie1
 1  PC1  state_aid_total_revenues,
 'Jefferson':      0    1
 0  PC0  ie1
 1  PC1  ie2,
 'Lewis':      0     1
 0  PC0  tsal
 1  PC1   cwr,
 'Ontario':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                   num_free_lunch,
 'Nassau':      0                  1
 0  PC0                ie1
 1  PC1  num_reduced_lunch,
 'Seneca':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                          av_twpu,
 'Yates':      0                                1
 0  PC0  adjusted_expenditures__subtotal
 1  PC1                              pwr,
 'Orange':      0         1
 0  PC0       ie1
 1  PC1  inc_twpu,
 'Sullivan':      0                                 1
 0  PC0  ie3_instructional_expenditures_i
 1  PC1                          inc_twpu,
 'Westchester':      0       1
 0  PC0  dcaadm
 1  PC1     cwr,
 'Washington':      0       1
 0  PC0  totrev
 1  PC1     cwr,
 'Rockland':      0             1
 0  PC0          tsal
 1  PC1  loc_eff_rate,
 'Suffolk':      0                                 1
 0  PC0  ie2_instructional_expenditures_i
 1  PC1                          inc_twpu}

In [6]:
# flatten dict to df

final_results = pd.DataFrame()

for k, v in results.items():
    df = v
    df.loc[:, 'county'] = k
    final_results = pd.concat([df, final_results], 0)

# final_results.columns = ['Unnamed: 0', 'X1', 'X2', 'y', 'y_pred', 'county']

In [7]:
final_results.head()

         X1        X2         y    y_pred   county
0 -0.427394 -0.048193  0.883901  0.907400  Suffolk
1  0.316367  0.643116  0.978836  0.899511  Suffolk
2  0.316367  0.643116  0.955908  0.848542  Suffolk
3  0.316367  0.643116  0.978836  0.901062  Suffolk
4  0.521213  1.308565  0.923875  0.873801  Suffolk

In [8]:
county_agg_results.head()

                   EV       MSE        R2        M1        M2         C
Albany       0.717430  0.002786  0.702530 -0.005648  0.025772  0.845356
Schoharie    0.635063  0.004321  0.070491 -0.002086  0.006593  0.830155
Greene       0.713559  0.003910  0.282484 -0.003642  0.010040  0.825641
Schenectady  0.715885  0.003802  0.744846 -0.012521  0.022741  0.832585
Allegany     0.632762  0.005167  0.106989 -0.001569  0.007430  0.851881

In [9]:
import pickle
# pickle.dump(final_results, open("../data/PCA_plus_preds.pkl", 'wb'))
# pickle.dump(county_agg_results, open("../data/county_agg_results.pkl", 'wb'))
final_results.to_csv('../data/PCA_plus_preds.csv')
county_agg_results.to_csv("../data/county_agg_results.csv")

In [10]:
a = pd.read_csv("../data/PCA_plus_preds.csv")
b = pd.read_csv("../data/county_agg_results.csv")

In [22]:
display(a.head())
# display(b.head(20))
b.R2.mean()

   Unnamed: 0        X1        X2         y    y_pred   county
0           0 -0.427394 -0.048193  0.883901  0.907400  Suffolk
1           1  0.316367  0.643116  0.978836  0.899511  Suffolk
2           2  0.316367  0.643116  0.955908  0.848542  Suffolk
3           3  0.316367  0.643116  0.978836  0.901062  Suffolk
4           4  0.521213  1.308565  0.923875  0.873801  Suffolk

0.277479366846494

In [24]:
# df_thin.groupby('county_name').count()
b.R2.min()

-0.2508933601201511

In [13]:
# df.tail(20).to_csv('/Users/dave/src/CSE6242/dave/small_headers.csv')

In [14]:
df.tail(20)

           X1        X2         y  y_pred   county
554 -4.587500 -2.784567  0.963077     NaN  Suffolk
555 -4.587500 -2.784567  0.954407     NaN  Suffolk
556 -4.363919 -1.804936  0.975155     NaN  Suffolk
557 -4.363919 -1.804936  0.960961     NaN  Suffolk
558 -4.363919 -1.804936  0.910299     NaN  Suffolk
559 -3.949911 -2.032501  0.943709     NaN  Suffolk
560 -3.949911 -2.032501  0.961078     NaN  Suffolk
561 -3.949911 -2.032501  0.941176     NaN  Suffolk
562 -3.804432 -1.700880  0.960784     NaN  Suffolk
563 -3.804432 -1.700880  0.950495     NaN  Suffolk
564 -3.804432 -1.700880  0.938312     NaN  Suffolk
565 -3.839119 -1.772186  0.967320     NaN  Suffolk
566 -3.839119 -1.772186  0.944805     NaN  Suffolk
567 -3.839119 -1.772186  0.917219     NaN  Suffolk
568 -3.929392 -1.780122  0.950820     NaN  Suffolk
569 -3.929392 -1.780122  0.941368     NaN  Suffolk
570 -3.929392 -1.780122  0.953416     NaN  Suffolk
571 -3.936791 -1.848364  0.957377     NaN  Suffolk
572 -3.936791 -1.848364  0.951768     NaN  Suffolk
573 -3.936791 -1.848364  0.965944     NaN  Suffolk

In [15]:
df.head()

         X1        X2         y    y_pred   county
0 -0.427394 -0.048193  0.883901  0.907400  Suffolk
1  0.316367  0.643116  0.978836  0.899511  Suffolk
2  0.316367  0.643116  0.955908  0.848542  Suffolk
3  0.316367  0.643116  0.978836  0.901062  Suffolk
4  0.521213  1.308565  0.923875  0.873801  Suffolk

# Feature Importance

In [16]:
from sklearn.feature_selection import SelectKBest, f_classif
from sklearn.linear_model import Lasso
from numpy import mean
from numpy import std
from numpy import absolute
from pandas import read_csv
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import RepeatedKFold
from sklearn.linear_model import Lasso
import seaborn as sns
from matplotlib import pyplot as plt
from sklearn.linear_model import LinearRegression
import warnings
warnings.filterwarnings('ignore')



def lasso_me(X, y, alphas, names, test_size=0.30, random_state=42):
    results_df = pd.DataFrame()
    results_df['Feature Name'] = names
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=test_size, random_state=random_state)
    for alpha in alphas:
#         temp_df = pd.DataFrame()
        L2 = Lasso(alpha=alpha, 
                   max_iter=10000,
                   fit_intercept=False)
#         cv = RepeatedKFold(n_splits=10, n_repeats=3, random_state=1)
#         # evaluate model
#         scores = cross_val_score(L2, X_train, y_train, scoring='neg_mean_absolute_error', cv=cv, n_jobs=-1)
#         # force scores to be positive
#         scores = absolute(scores)
        L2.fit(X_train, y_train)
        column_name = 'Alpha = %f' % alpha
        results_df[column_name] = L2.coef_
    return(results_df)

county_lasso = {}

for county in df_thin.county_name.unique():
    county_df = df_thin[df_thin.county_name == county].drop(columns = ['county_name', 'num_am_ind'])
    X = county_df.drop(["gr_droppedout_pct", "gr_graduated_pct", "gr_iep_pct", "gr_ged_pct", "gr_stillenrolled_pct"], axis=1, inplace=False)
    y = pd.DataFrame({'y':county_df['gr_graduated_pct']}).reset_index()['y']

    x = StandardScaler().fit_transform(X)
    alphas = [0.0001, 0.001, 0.01]
    county_lasso[county] = lasso_me(x, y, 
                                    alphas = alphas, 
                                    names=X.columns, 
                                    test_size=0.30, 
                                    random_state=42)

# Feature Importance through Lasso Selection
Note: I don't love these results because we didn't validate typical assumptions of homoskedasticity, linearity, independence, etc.  They are, however, foundationally interesting for other types of studies, so I'm leaving them in here:

-dave

In [17]:
for county in df_thin.county_name.unique():
    print("\n==================== " + county + "========================")
    display(county_lasso[county].sort_values(by=['Alpha = %f' % a for a in alphas], ascending=False).head(3))

==================== Albany========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,0.919743,0.000000,-0.0
10,star,0.654677,0.047407,-0.0
29,opmt,0.439329,0.109603,0.0

==================== Schoharie========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
31,heal,0.765157,0.044714,0.000000
55,adjusted_expenditures__subtotal,0.673220,0.000000,0.000000
47,av_twpu,0.437008,0.200777,0.012889

==================== Greene========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
10,star,3.097613,0.984322,-0.0
45,rev_pupil,2.364885,0.000000,0.0
55,adjusted_expenditures__subtotal,1.938002,0.000000,-0.0

==================== Schenectady========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
9         staid          0.651300          0.000000              -0.0
29         opmt          0.625478          0.225124               0.0
45    rev_pupil          0.517150         -0.000000              -0.0

==================== Allegany========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
44       dcaadm          0.581517          0.067696               0.0
12         lrev          0.362798          0.000000              -0.0
26          ois          0.337789          0.187084               0.0

==================== Steuben========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
3     num_white          1.111859           0.80214              -0.0
20         tsal          0.732431           0.00000              -0.0
12         lrev          0.551233           0.00000              -0.0

==================== Livingston========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
3     num_white          1.348376          0.239780              -0.0
45    rev_pupil          0.790361          0.220072               0.0
31         heal          0.632966          0.205072               0.0

==================== Wyoming========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,1.718141,0.173672,0.0
45,rev_pupil,0.988831,0.094868,-0.0
52,instructional_salaries,0.865597,0.000000,0.0

==================== Cattaraugus========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
55,adjusted_expenditures__subtotal,1.306676,0.000000,0.000000
47,av_twpu,0.707897,0.363476,0.000832
10,star,0.274274,0.000000,-0.000000

==================== Broome========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
31         heal          1.130542          0.000000              -0.0
44       dcaadm          0.803738          0.301516              -0.0
9         staid          0.405989          0.000000              -0.0

==================== Chenango========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,0.771671,0.000000,0.0
12,lrev,0.636592,0.469863,0.0
44,dcaadm,0.475426,0.249898,0.0

==================== Tioga========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
44       dcaadm          0.969436               0.0               0.0
45    rev_pupil          0.677797              -0.0              -0.0
31         heal          0.669630               0.0               0.0

==================== Delaware========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,1.949040,0.000000,-0.000000
52,instructional_salaries,0.528829,0.000000,-0.000000
38,dsp,0.322616,0.190478,0.028549

==================== Cortland========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
44,dcaadm,1.606068,0.000000,0.0
9,staid,1.310542,0.375342,0.0
53,instructional_fringe_benefits,1.292936,0.000000,0.0

==================== Chautauqua========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
45    rev_pupil          0.883390              -0.0              -0.0
44       dcaadm          0.657520               0.0               0.0
10         star          0.590954               0.0               0.0

==================== Erie========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
29         opmt          0.805469               0.0              -0.0
44       dcaadm          0.713296              -0.0              -0.0
9         staid          0.624946              -0.0              -0.0

==================== Cayuga========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
10,star,0.728295,-0.0,-0.0
55,adjusted_expenditures__subtotal,0.670302,-0.0,-0.0
31,heal,0.508445,0.0,-0.0

==================== Onondaga========================

      Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
22             cds          1.072307          0.012536               0.0
5   num_free_lunch          0.924495          0.000000               0.0
32             oeb          0.830815          0.177505               0.0

==================== Oswego========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
12         lrev          0.395763          0.056862               0.0
20         tsal          0.302863          0.100707               0.0
29         opmt          0.240332          0.174168               0.0

==================== Wayne========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
46,exp_pupil,0.769169,0.040641,0.0
9,staid,0.565167,0.197648,0.0
52,instructional_salaries,0.468869,0.000000,0.0

==================== Tompkins========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
0     num_asian          1.034902          0.240038               0.0
10         star          0.919856          0.117646               0.0
32          oeb          0.437226          0.135101               0.0

==================== Chemung========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
10,star,5.435696,0.725993,0.0
52,instructional_salaries,2.366152,0.000000,0.0
31,heal,1.356911,0.000000,-0.0

==================== Schuyler========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
10,star,3.425780,0.682942,0.0
53,instructional_fringe_benefits,2.863807,0.000000,-0.0
3,num_white,0.841581,-0.000000,-0.0

==================== Otsego========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,1.524214,0.035226,-0.00000
46,exp_pupil,0.762153,0.060095,0.01062
3,num_white,0.375002,0.091142,-0.00000

==================== Madison========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
29,opmt,0.489078,0.411498,0.0
50,apwr,0.384690,0.160168,0.0
52,instructional_salaries,0.323594,0.000000,-0.0

==================== Clinton========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,2.172713,0.728787,0.0
52,instructional_salaries,1.667348,0.155923,0.0
45,rev_pupil,1.474854,-0.000000,-0.0

==================== Essex========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
3,num_white,2.120532,0.605151,0.0
45,rev_pupil,0.683940,0.051026,0.0
52,instructional_salaries,0.625403,0.000000,0.0

==================== Franklin========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,1.423475,0.0,-0.0
49,pwr,1.082485,-0.0,0.0
9,staid,0.977447,0.0,0.0

==================== Columbia========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,2.243401,0.331344,0.0
20,tsal,0.754917,0.000000,0.0
57,ie1_total,0.566260,0.250592,0.0

==================== Dutchess========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,1.223023,0.000000,0.0
29,opmt,1.115391,0.341112,0.0
45,rev_pupil,0.718594,-0.000000,-0.0

==================== Rensselaer========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
52,instructional_salaries,1.246569,0.000000,0.0
12,lrev,0.720963,0.061260,0.0
20,tsal,0.536784,0.588758,0.0

==================== Ulster========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
44       dcaadm          1.754691          0.226239               0.0
45    rev_pupil          1.166658          0.221535               0.0
20         tsal          0.869176          0.363274               0.0

==================== Putnam========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
52,instructional_salaries,2.266455,0.000000,-0.0
53,instructional_fringe_benefits,1.560240,0.000000,-0.0
2,num_hisp,1.106675,0.716085,0.0

==================== Genesee========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
3     num_white          0.494578          0.009516              -0.0
45    rev_pupil          0.377922          0.214873               0.0
31         heal          0.353122          0.043481              -0.0

==================== Niagara========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
12         lrev          0.582936          0.373236          0.047805
44       dcaadm          0.402935          0.000000         -0.000000
25         tui2          0.387118          0.273420          0.040546

==================== Warren========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
45,rev_pupil,0.832490,0.040327,-0.0
53,instructional_fringe_benefits,0.448163,0.000000,-0.0
5,num_free_lunch,0.369385,0.299106,0.0

==================== St. Lawrence========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
10         star          0.349314          0.142614               0.0
46    exp_pupil          0.257920          0.000000               0.0
4       num_lep          0.217940          0.060336               0.0

==================== Fulton========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
2      num_hisp          1.327001          0.392711          0.000000
45    rev_pupil          1.019180         -0.000000         -0.015928
44       dcaadm          1.016699          0.093594          0.000000

==================== Montgomery========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,0.617603,0.000000,-0.0
5,num_free_lunch,0.417523,0.229433,0.0
2,num_hisp,0.329465,-0.000000,0.0

==================== Hamilton========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
55,adjusted_expenditures__subtotal,2.949226,0.000000,0.0
61,ie3_adj_exp,1.537311,0.545901,0.0
31,heal,1.178026,0.000000,0.0

==================== Saratoga========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
46    exp_pupil          1.084063          0.032316          0.014062
43          var          0.351218          0.010096         -0.016622
48     inc_twpu          0.331994          0.162234          0.071890

==================== Monroe========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
4       num_lep          1.209530          0.000000              -0.0
31         heal          0.945547          0.078174              -0.0
20         tsal          0.510539          0.000000              -0.0

==================== Orleans========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
10,star,1.805189,0.105023,0.0
45,rev_pupil,1.299578,0.738463,0.0
55,adjusted_expenditures__subtotal,0.606783,0.000000,0.0

==================== Herkimer========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
44,dcaadm,1.818849,0.557145,0.0
53,instructional_fringe_benefits,0.700600,0.000000,0.0
10,star,0.675876,0.000000,0.0

==================== Oneida========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
5,num_free_lunch,0.529221,0.133374,-0.0
10,star,0.523497,0.253341,-0.0
53,instructional_fringe_benefits,0.221398,0.000000,-0.0

==================== Jefferson========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
46    exp_pupil          0.586052         -0.000000               0.0
47      av_twpu          0.460420          0.210539               0.0
13       fedrev          0.398674          0.224150               0.0

==================== Lewis========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
46    exp_pupil          4.032186          0.000000         -0.000990
43          var          1.471373          0.455834          0.000000
8           ufb          1.437872          0.927582          0.093755

==================== Ontario========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,2.134941,0.104578,0.000000
46,exp_pupil,0.756130,0.000000,-0.000000
27,oiexp,0.394225,0.149426,0.007062

==================== Nassau========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
3,num_white,3.862841,1.751244,0.048094
53,instructional_fringe_benefits,3.360159,0.314708,-0.000000
52,instructional_salaries,2.426109,-0.000000,-0.000000

==================== Seneca========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,4.075433,0.000000,0.000000
52,instructional_salaries,2.762193,0.000000,0.000000
4,num_lep,2.128807,1.273303,0.003757

==================== Yates========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
2      num_hisp         13.565161          1.357933              -0.0
36       subtot          8.844811         -0.000000              -0.0
47      av_twpu          7.910442          1.744766              -0.0

==================== Orange========================

  Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
3    num_white          0.723997         -0.000000              -0.0
1    num_black          0.628945          0.098161              -0.0
2     num_hisp          0.531725          0.000000              -0.0

==================== Sullivan========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,2.855401,0.295619,0.0
20,tsal,1.038818,0.047264,0.0
46,exp_pupil,0.723002,-0.000000,0.0

==================== Westchester========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
31         heal          0.800113          0.000000              -0.0
2      num_hisp          0.708593          0.000000              -0.0
50         apwr          0.598792          0.223454               0.0

==================== Washington========================

,Feature Name,Alpha = 0.000100,Alpha = 0.001000,Alpha = 0.010000
53,instructional_fringe_benefits,1.137096,0.319667,0.00000
45,rev_pupil,0.343343,-0.107875,-0.01439
22,cds,0.313746,0.198826,0.00000

==================== Rockland========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
25         tui2          6.349767          2.442133         -0.000000
43          var          6.272244          5.451161          0.222461
37        trans          5.918216          9.579342          0.350789

==================== Suffolk========================

   Feature Name  Alpha = 0.000100  Alpha = 0.001000  Alpha = 0.010000
45    rev_pupil          1.772408         -0.000000              -0.0
10         star          1.551602          0.522627               0.0
31         heal          0.785227          0.387706               0.0